--[[

       Ассемблер Hack

Программа : набор строк, содержащих [ Команда | Комментарии | Метка ]

Команда : А-команда или С-команда
Комментарий : строка с началом "//"
Метка     - обозначение адреса памяти, записывается (xxx), xxx = символ

Символы - всё, что не начинается с цифры.

Предопределёные символы -
    R0, R1,..,R15 -> 0, 1, .., 15
    SP, LCL, ARG, THIS, THAT -> 0, 1, 2, 3, 4
    SCREEN -> 16384 
    KBD    -> 24576

Переменная - символ такой, что не метка и не предопределённый.
             указывает на ячейку памяти, начиная с RAM[16]

Символы чувствительны к регистру.

Пустые строки и пробелы игнорируются.

Мнемонии ассемблера пишутся заглавными буквами
  

A-команда
  Симв:   @xxx,  где xxx = 0..32767
  Двоич:  0vvvvvvvvvvvvvvv  v..vv 15-бит значение 0..32767  

С-команда

  Симв:   dest = comp ; jump  (comp - required, no dest -> no "=", no "jump" -> no ";" )
  Двоич:  111accccccdddjjj
]]

comp={}

comp["0"]   = "0 " .. "1 0 1 0 1 0"
comp["1"]   = "0 " .. "1 1 1 1 1 1"
comp["-1"]  = "0 " .. "1 1 1 0 1 0"
comp["D"]   = "0 " .. "0 0 1 1 0 0"
comp["A"]   = "0 " .. "1 1 0 0 0 0"
comp["M"]   = "1 " .. "1 1 0 0 0 0"
comp["!D"]  = "0 " .. "0 0 1 1 0 1"
comp["!A"]  = "0 " .. "1 1 0 0 0 1"
comp["!M"]  = "1 " .. "1 1 0 0 0 1"
comp["-D"]  = "0 " .. "0 0 1 1 1 1"
comp["-A"]  = "0 " .. "1 1 0 0 1 1" 
comp["-M"]  = "1 " .. "1 1 0 0 1 1"
comp["D+1"] = "0 " .. "0 1 1 1 1 1"
comp["A+1"] = "0 " .. "1 1 0 1 1 1"
comp["M+1"] = "1 " .. "1 1 0 1 1 1"
comp["D-1"] = "0 " .. "0 0 1 1 1 0"
comp["A-1"] = "0 " .. "1 1 0 0 1 0"
comp["M-1"] = "1 " .. "1 1 0 0 1 0"
comp["D+A"] = "0 " .. "0 0 0 0 1 0"
comp["D+M"] = "1 " .. "0 0 0 0 1 0"
comp["D-A"] = "0 " .. "0 1 0 0 1 1"
comp["D-M"] = "1 " .. "0 1 0 0 1 1"
comp["A-D"] = "0 " .. "0 0 0 1 1 1"
comp["M-D"] = "1 " .. "0 0 0 1 1 1"
comp["D&A"] = "0 " .. "0 0 0 0 0 0"
comp["D&M"] = "1 " .. "0 0 0 0 0 0"
comp["D|A"] = "0 " .. "0 1 0 1 0 1"
comp["D|M"] = "1 " .. "0 1 0 1 0 1"

dest = {
   ["M"] = "0 0 1",
   ["D"] = "0 1 0",
  ["DM"] = "0 1 1",
   ["A"] = "1 0 0",
  ["AM"] = "1 0 1",
  ["AD"] = "1 1 0",
 ["ADM"] = "1 1 1"
}

jump = {
 ["JGT"] = "0 0 1",
 ["JEQ"] = "0 1 0",
 ["JGE"] = "0 1 1",
 ["JLT"] = "1 0 0",
 ["JNE"] = "1 0 1",
 ["JLE"] = "1 1 0",
 ["JMP"] = "1 1 1",
}

-- Предопределёные символы 
symtable = {
  SP = 0, LCL = 1, ARG = 2,THIS = 3, THAT = 4,
  SCREEN = 16384 , KBD  = 24576
}

-- Регистры
  --R0, R1,..,R15 -> 0, 1, .., 15
for i = 0,15 do
  symtable["R"..i] = i
end  

-- Маска для dest=comp